app/Http/Controllers/Pos/PosController.php

    public function index()
    {
        // Lấy thời gian hiện tại và các mốc thời gian cần thiết
        $now = now();
        $nextHalfHour = $now->copy()->addMinutes(30);
        $fifteenMinutesAgo = $now->copy()->subMinutes(15);

        // Lấy danh sách các bàn
        $tables = Table::all();
        $orders = Order::with(['reservation', 'staff', 'tables', 'orderItems', 'customer'])->get();
        $dishes = Dishes::all();


        // Lấy các đơn đặt bàn sắp đến trong 30 phút tới
        $upcomingReservations = Reservation::where('reservation_date', '=', today())
            ->where('reservation_time', '>=', $now->toTimeString())
            ->where('reservation_time', '<=', $nextHalfHour->toTimeString())
            ->get();

        // Lấy các đơn đặt bàn đã quá giờ nhưng vẫn trong khoảng 15 phút trước (chờ khách)
        $lateReservations = Reservation::where('reservation_date', '=', today())
            ->where('reservation_time', '<', $now->toTimeString())
            ->where('reservation_time', '>=', $fifteenMinutesAgo->toTimeString())
            ->where('status', 'Pending')
            ->get();
---
select * from `orders` where `orders`.`deleted_at` is null order by `created_at` desc limit 1
select * from `dishes` where `dishes`.`deleted_at` is null
select * from `reservations` where `reservation_date` = '2024-11-04 00:00:00' and `reservation_time` < '14:42:02' and `reservation_time` >= '14:27:02' and `status` = 'Pending' and `reservations`.`deleted_at` is null

        //lấy  danh sách đơn đặt bàn đã được xác nhận
        $reservations = Reservation::where('status', 'Confirmed')->paginate(5);
        // Truyền dữ liệu tới view
        return view('pos.index', [
            'tables' => $tables,
            'order' => $orders,
            'dishes' => $dishes,
            'upcomingReservations' => $upcomingReservations,
            'lateReservations' => $lateReservations,
            'availableTables' => $availableTables,
            'availableTablesCount' => Table::query()->where('status', 'available')->count(),
            'reservedTablesCount' => Table::query()->where('status', 'reserved')->count(),
            'occupiedTablesCount' => Table::query()->where('status', 'occupied')->count(),
            'totalTablesCount' => $tables->count(),
            'reservations' => $reservations,
        ]);
---
select * from `tables` where `status` = 'available' and `tables`.`deleted_at` is null
select count(*) as aggregate from `reservations` where `status` = 'Confirmed' and `reservations`.`deleted_at` is null
select count(*) as aggregate from `tables` where `status` = 'occupied' and `tables`.`deleted_at` is null
select count(*) as aggregate from `tables` where `status` = 'available' and `tables`.`deleted_at` is null