app/Http/Controllers/Client/HomeController.php

select count(*) as aggregate from `dishes` where `dishes`.`deleted_at` is null
select * from `combos` where `combos`.`deleted_at` is null
---
    public function index()
    {
        $dishes = Dishes::paginate(10);
        $combos = Combo::all();