app/Http/Controllers/KitchenController.php

    public function index()
    {
        $items = OrderItem::where('status', 'đang chế biến')
            ->orWhere('status', 'chờ cung ứng')
            ->with(['dish', 'order.table'])
            ->get();
---
select * from `dishes` where `dishes`.`id` in (1) and `dishes`.`deleted_at` is null
select * from `order_items` where `status` = 'đang chế biến' or `status` = 'chờ cung ứng'
select * from `orders` where `orders`.`id` in (1, 2, 3) and `orders`.`deleted_at` is null
select * from `tables` where `tables`.`id` in (1, 2, 3) and `tables`.`deleted_at` is null

    public function cookAll($id)
    {
        $item = OrderItem::find($id);
        if ($item) {
            $item->status = 'chờ cung ứng';
            $item->save();
            $items = OrderItem::whereIn('status', ['đang chế biến', 'chờ cung ứng'])
                ->with(['dish', 'order.table'])
                ->get();
---
select * from `order_items` where `order_items`.`id` = '7' limit 1
update `order_items` set `status` = 'chờ cung ứng', `order_items`.`updated_at` = '2024-11-04 21:18:46' where `id` = 7
select * from `dishes` where `dishes`.`id` in (1) and `dishes`.`deleted_at` is null
select * from `order_items` where `status` in ('đang chế biến', 'chờ cung ứng')
select * from `orders` where `orders`.`id` in (1, 2, 3) and `orders`.`deleted_at` is null
select * from `tables` where `tables`.`id` in (1, 2, 3) and `tables`.`deleted_at` is null

    public function doneAll($id)
    {
        $item = OrderItem::find($id);
        if ($item) {
            $item->status = 'hoàn thành';
            $item->save();
            $items = OrderItem::whereIn('status', ['đang chế biến', 'chờ cung ứng'])
                ->with(['dish', 'order.table'])
                ->get();
---
select * from `order_items` where `order_items`.`id` = '6' limit 1
update `order_items` set `status` = 'hoàn thành', `order_items`.`updated_at` = '2024-11-04 22:02:36' where `id` = 5
select * from `dishes` where `dishes`.`id` in (1) and `dishes`.`deleted_at` is null
select * from `order_items` where `status` in ('đang chế biến', 'chờ cung ứng')
select * from `orders` where `orders`.`id` in (1, 4) and `orders`.`deleted_at` is null
select * from `tables` where `tables`.`id` in (1, 4) and `tables`.`deleted_at` is null