app/Http/Controllers/KitchenController.php

            $item->status = 'chờ cung ứng';
            $item->save();
            $item = Kitchen::find($id);
            $orderItems = Order::with(['orderItems', 'orderItems.dish'])->findOrFail($item->order->id);
            $itemName = $item->dish->name;
            $tableId = Table::with('orders')->findOrFail($request->tableId);
            $order = Order::with('tables')->findOrFail($item->order->id);
---
select * from `dishes` where `dishes`.`id` in (1, 6) and `dishes`.`deleted_at` is null
select * from `orders` where `orders`.`id` in (1, 4) and `orders`.`deleted_at` is null
select * from `tables` where `tables`.`id` in (1, 4) and `tables`.`deleted_at` is null

                ->where('status', 'pending')
                ->firstOrFail()
                ->id;
            $orderItem = OrderItem::where('order_id', $orderId)
                ->where(function ($query) {
                    $query->where('status', 'chờ xử lý')
                        ->orWhere('status', 'đang xử lý');
                })
                ->get();
---
select * from `order_items` where `status` in ('đang chế biến', 'chờ cung ứng')