app/Http/Controllers/Admin/IngredientTypeController.php

insert into `ingredient_types` (`name`, `updated_at`, `created_at`) values ('Nbthu', '2024-10-02 21:07:00', '2024-10-02 21:07:00')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255|unique:ingredient_types',
        ]);

        IngredientType::create($request->all());