app/Http/Controllers/Admin/RefundController.php

    public function create($reservation_id)
    {
        $reservation = Reservation::find($reservation_id);
---
select * from `reservations` where `reservations`.`id` = '1' and `reservations`.`deleted_at` is null limit 1

    public function store(Request $request)
{
    // dd($request->all());
    $request->validate([
        'account_name' => 'required|string',
        'account_number' => 'required|integer',
        'refund_amount' => 'required|numeric|min:0',
        'bank_name' => 'required|string',
        'email' => 'required|email',
        'reason' => 'nullable|string',

    ]);
    // dd($request->refund_amount);

    // Tạo bản ghi hoàn tiền
    $refund = Refund::create([
        'reservation_id' => $request->reservation_id,
        'account_name' => $request->account_name,
        'account_number' => $request->account_number,
        'refund_amount' => $request->refund_amount,
        'bank_name' => $request->bank_name,
        'email' => $request->email,
        'reason' => $request->reason,
        'confirmed_by' => $request->confirmed_by,
        // 'confirmed_at ' => $request->confirmed_at,
        'status' => 'Refund',

    ]);
---
insert into `refunds` (`reservation_id`, `account_name`, `account_number`, `refund_amount`, `bank_name`, `email`, `reason`, `status`) values ('1', 'KHanh', '678643578888', '12000000', 'vcb', 'khanhnnph34021@fpt.edu.vn', 'TÔi bận', 'Refund')



    // Cập nhật trạng thái đặt chỗ thành "Đã hoàn cọc"
    $reservation = Reservation::find($request->reservation_id);
    $reservation->status = "Refund";
    $reservation->save();
---
select * from `reservations` where `reservations`.`id` = '1' and `reservations`.`deleted_at` is null limit 1
update `reservations` set `status` = 'Refund', `reservations`.`updated_at` = '2024-10-22 18:51:11' where `id` = 1