app/Http/Controllers/Admin/ReservationController.php

    public function updateOverdueReservations(Request $request)
    {
        $reservations = Reservation::with('customer')
            ->when($request->customer_name, function ($query) use ($request) {
                $query->whereHas('customer', function ($q) use ($request) {
                    $q->where('name', 'like', '%' . $request->customer_name . '%');
                });
            })
            ->paginate(10);

        $now = Carbon::now();

        // Cập nhật các đơn quá hạn thành 'Cancelled'
        Reservation::where('reservation_date', '=', $now->toDateString())
            ->where('reservation_time', '<', $now->copy()->subMinutes(15)->toTimeString())
            ->where('status', 'Confirmed')
            ->update(['status' => 'Cancelled']);

        // Đơn sắp đến hạn trong vòng 30 phút tới
        $upcomingReservations = Reservation::where('reservation_date', '=', $now->toDateString())
            ->where('reservation_time', '>=', $now->toTimeString())
            ->where('reservation_time', '<=', $now->copy()->addMinutes(30)->toTimeString())
            ->where('status', 'Confirmed')
            ->get();

        // Đơn đang chờ khách trong 15 phút
        $waitingReservations = Reservation::where('reservation_date', '=', $now->toDateString())
            ->where('reservation_time', '<', $now->toTimeString())
            ->where('reservation_time', '>=', $now->copy()->subMinutes(15)->toTimeString())
            ->where('status', 'Confirmed')
            ->get();

        // Đơn đã quá hạn
        $overdueReservations = Reservation::where('reservation_date', '=', $now->toDateString())
            ->where('reservation_time', '<', $now->copy()->subMinutes(15)->toTimeString())
            ->where('status', 'Cancelled')
            ->get();

        // Lấy tất cả danh sách đặt bàn
        $reservations = Reservation::all();
        $reservations = Reservation::paginate(10);
---
select * from `reservations` where `reservations`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `reservations` where `reservations`.`deleted_at` is null
update `reservations` set `status` = 'Cancelled', `reservations`.`updated_at` = '2024-09-30 16:17:48' where `reservation_date` = '2024-09-30' and `reservation_time` < '16:02:48' and `status` = 'Pending' and `reservations`.`deleted_at` is null
select * from `reservations` where `reservation_date` = '2024-09-30' and `reservation_time` >= '16:17:48' and `reservation_time` <= '16:47:48' and `status` = 'Pending' and `reservations`.`deleted_at` is null
select * from `reservations` where `reservation_date` = '2024-09-30' and `reservation_time` < '16:17:48' and `reservation_time` >= '16:02:48' and `status` = 'Pending' and `reservations`.`deleted_at` is null
select * from `reservations` where `reservation_date` = '2024-09-30' and `reservation_time` < '16:02:48' and `status` = 'Cancelled' and `reservations`.`deleted_at` is null
select * from `reservations` where `reservations`.`deleted_at` is null

    private function getUpcomingReservations()
    {
        $now = Carbon::now();

        return Reservation::where('reservation_date', '=', $now->toDateString())
            ->where('reservation_time', '>=', $now->toTimeString())
            ->where('reservation_time', '<=', $now->copy()->addMinutes(30)->toTimeString())
            ->where('status', 'Confirmed')
---
select * from `reservations` where `reservation_date` = '2024-09-30' and `reservation_time` >= '16:17:48' and `reservation_time` <= '16:47:48' and `status` = 'Pending' and `reservations`.`deleted_at` is null

    private function getWaitingReservations()
    {
        $now = Carbon::now();

        return Reservation::where('reservation_date', '=', $now->toDateString())
            ->where('reservation_time', '<', $now->toTimeString())
            ->where('reservation_time', '>=', $now->copy()->subMinutes(15)->toTimeString())
            ->where('status', 'Confirmed')
            ->get();
---
select * from `reservations` where `reservation_date` = '2024-10-22' and `reservation_time` >= '19:07:09' and `reservation_time` <= '19:37:09' and `status` = 'Pending' and `reservations`.`deleted_at` is null

    private function getOverdueReservations()
    {
        $now = Carbon::now();

        return Reservation::where('reservation_date', '=', $now->toDateString())
            ->where('reservation_time', '<', $now->copy()->subMinutes(15)->toTimeString())
            ->where('status', 'Cancelled')
            ->get();
---
select * from `reservations` where `reservation_date` = '2024-09-30' and `reservation_time` < '16:02:48' and `status` = 'Cancelled' and `reservations`.`deleted_at` is null

    public function edit($id)
    {
        $reservation = Reservation::findOrFail($id);
        $customers = User::all();
        $coupons = Coupon::all();
---
select * from `reservations` where `reservations`.`id` = '3' and `reservations`.`deleted_at` is null limit 1
select * from `users` where `users`.`deleted_at` is null
select * from `coupons` where `coupons`.`deleted_at` is null

    public function update(Request $request, $id)
    {
        DB::beginTransaction();
        try {
            $validated = $request->validate([
                'customer_name' => 'required|string|max:255',
                'reservation_time' => 'required|date_format:Y-m-d\TH:i',
                'guest_count' => 'required|integer|min:1',
                'note' => 'nullable|string',
                'status' => 'required|in:Confirmed,Pending,Cancelled',
                'cancelled_reason' => 'nullable|string|max:255',
            ]);


            $validated['deposit_amount'] = $request->input('guest_count') >= 6
                ? $request->input('guest_count') * 100000
                : 0;


            $validated['reservation_time'] = Carbon::createFromFormat('Y-m-d\TH:i', $request->reservation_time)
                ->format('Y-m-d H:i:s');

            $reservation = Reservation::findOrFail($id);
            $reservation->update($validated);
---
select * from `reservations` where `reservations`.`id` = '1' and `reservations`.`deleted_at` is null limit 1
update `reservations` set `reservation_time` = '2024-09-30 11:05:00', `deposit_amount` = 0, `reservations`.`updated_at` = '2024-09-30 10:52:12' where `id` = 1

    public function show($id)
    {
        $reservation = Reservation::with('customer')->findOrFail($id);
---
select * from `reservations` where `reservations`.`id` = '1' and `reservations`.`deleted_at` is null limit 1

    public function checkout($orderId, Request $request)
    {
        DB::transaction(function () use ($request, $orderId) {
            $itemsCount = DB::table('orders_items')->where('order_id', $orderId)->count();
            $order = Order::find($orderId);
            $table = Table::find($order->table_id);
            $itemNames = $request->item_name;
            $quantities = $request->quantity;
            foreach ($itemNames as $index => $itemName) {
                DB::table('orders_items')
                    ->where('order_id', $orderId)
                    ->where('dish_id', $itemName)
                    ->update(['quantity' => DB::raw('quantity - ' . $quantities[$index])]);
                DB::table('orders_items')
                    ->where('order_id', $orderId)
                    ->where('dish_id', $itemName)
                    ->where('quantity', '<=', '0')
                    ->delete();
            }
            if ($itemsCount == 0) {
                Order::where('id', '=', $orderId)
                    ->update(['status' => 'completed']);
                Table::where('id', '=', $table->id)
---
select * from `tables` where `tables`.`deleted_at` is null