app/Http/Controllers/Admin/ReservationController.php

    public function createReservation(StoreReservationRquest $request)
    {
        // Kiểm tra số lượng khách, nếu >= 6 thì chuyển hướng đến trang đặt cọc
        if ($request->guest_count >= 6) {
            // Lưu thông tin khách hàng tạm thời để sử dụng ở trang cọc
            $customerInformation = $request->all();
            return redirect()->route('deposit.client', compact('customerInformation'));
        }

        } else {
            // Thực hiện giao dịch đặt bàn mà không cần cọc
            $reservation = DB::transaction(function () use ($request) {
                $customer_id = null;


                if (auth()->check()) {
                    // Nếu đã đăng nhập, chỉ lấy customer_id
                    $customer_id = auth()->id();
                } else {

                    $user = User::where('phone', $request->user_phone)->first();
                    if (!isset($user) && $user == null) {
                        // Nếu chưa đăng nhập, tạo tài khoản tạm thời
                        $user = User::create([
                            'name' => $request->user_name,
                            'phone' => $request->user_phone,
                            'password' => bcrypt(Str::random(10)),
                            'status' => 'inactive',
                        ]);
                    }
                    $customer_id = $user->id;
                }
---
insert into `users` (`name`, `phone`, `password`, `status`, `updated_at`, `created_at`) values ('Hà Đăng Hoàng', '0987653241', '$2y$12$79sgO545s3R8V/xwcNIINuWx5.lIhypGEn0sFcA1nf7s9T1KxKu8m', 'inactive', '2024-09-30 16:12:13', '2024-09-30 16:12:13')