app/Http/Controllers/Admin/SupplierController.php

select count(*) as aggregate from `suppliers`
---
    public function index(Request $request)
    {
        $suppliers = Supplier::when($request->name, function ($query) use ($request) {
            $query->where('name', 'like', '%' . $request->name . '%');
        })->paginate(10);

insert into `suppliers` (`name`, `phone`, `email`, `address`, `updated_at`, `created_at`) values ('nguyen ba thu', '0984378434', 'thunb@gmai.com', 'Yên Ninh Ý Yên, Thị Trấn Lâm Yên Ninh Ý Yên', '2024-10-02 21:06:46', '2024-10-02 21:06:46')
---
    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'phone' => 'required|string|max:20',
            'email' => 'nullable|email|max:255',
            'address' => 'nullable|string|max:255',
        ]);

        Supplier::create([
            'name' => $request->name,
            'phone' => $request->phone,
            'email' => $request->email,
            'address' => $request->address,
        ]);