app/Http/Controllers/Admin/TableController.php

select * from `tables` where `tables`.`deleted_at` is null limit 10 offset 0
select count(*) as aggregate from `tables` where `tables`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $query = Table::query();

        if ($request->filled('name')) {
            $query->where('name', 'like', '%' . $request->name . '%');
        }

        if ($request->filled('table_type')) {
            $query->where('table_type', $request->table_type);
        }

        $tables = $query->paginate(10);